STMicroelectronics/STM32_open_pin_data/boards/F43_Evaluation_Board_STM32L4R9I-EVAL_STM32L4R9AI_Board_AllConfig.ioc
#Copyright (c) 2023 STMicroelectronics. All rights reserved.
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_9
ADC1.CommonPathInternal=null|null|null|null
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
ADC1.master=1
CAD.formats=
CAD.pinconfig=
CAD.provider=
DSIHOST_CKN.GPIOParameters=GPIO_Label
DSIHOST_CKN.GPIO_Label=DSI_CK_N
DSIHOST_CKN.Locked=true
DSIHOST_CKN.Mode=DSIHost_Standalone
DSIHOST_CKN.Signal=DSIHOST_CKN
DSIHOST_CKP.GPIOParameters=GPIO_Label
DSIHOST_CKP.GPIO_Label=DSI_CK_P
DSIHOST_CKP.Locked=true
DSIHOST_CKP.Mode=DSIHost_Standalone
DSIHOST_CKP.Signal=DSIHOST_CKP
DSIHOST_D0N.GPIOParameters=GPIO_Label
DSIHOST_D0N.GPIO_Label=DSI_DO_N
DSIHOST_D0N.Locked=true
DSIHOST_D0N.Mode=DSIHost_Standalone
DSIHOST_D0N.Signal=DSIHOST_D0N
DSIHOST_D0P.GPIOParameters=GPIO_Label
DSIHOST_D0P.GPIO_Label=DSI_DO_P
DSIHOST_D0P.Locked=true
DSIHOST_D0P.Mode=DSIHost_Standalone
DSIHOST_D0P.Signal=DSIHOST_D0P
DSIHOST_D1N.GPIOParameters=GPIO_Label
DSIHOST_D1N.GPIO_Label=DSI_D1_N
DSIHOST_D1N.Locked=true
DSIHOST_D1N.Mode=DSIHost_Standalone
DSIHOST_D1N.Signal=DSIHOST_D1N
DSIHOST_D1P.GPIOParameters=GPIO_Label
DSIHOST_D1P.GPIO_Label=DSI_D1_P
DSIHOST_D1P.Locked=true
DSIHOST_D1P.Mode=DSIHost_Standalone
DSIHOST_D1P.Signal=DSIHOST_D1P
File.Version=6
I2C2.IPParameters=Timing
I2C2.Timing=0x00707CBB
KeepUserPlacement=false
Mcu.CPN=STM32L4R9AII6
Mcu.Family=STM32L4
Mcu.IP0=ADC1
Mcu.IP1=DFSDM1
Mcu.IP10=SAI1
Mcu.IP11=SDMMC1
Mcu.IP12=SPI2
Mcu.IP13=SYS
Mcu.IP14=TSC
Mcu.IP15=USART3
Mcu.IP16=USB_OTG_FS
Mcu.IP2=DSIHOST
Mcu.IP3=FMC
Mcu.IP4=I2C2
Mcu.IP5=LPUART1
Mcu.IP6=LTDC
Mcu.IP7=NVIC
Mcu.IP8=OCTOSPI1
Mcu.IP9=RCC
Mcu.IPNb=17
Mcu.Name=STM32L4R9A(G-I)Ix
Mcu.Package=UFBGA169
Mcu.Pin0=PH2
Mcu.Pin1=PE0
Mcu.Pin10=PB5
Mcu.Pin100=DSIHOST_CKP
Mcu.Pin101=DSIHOST_CKN
Mcu.Pin102=PA5
Mcu.Pin103=PA6
Mcu.Pin104=PB1
Mcu.Pin105=PF14
Mcu.Pin106=PE7
Mcu.Pin107=PE13
Mcu.Pin108=PH5
Mcu.Pin109=PB15
Mcu.Pin11=PG9
Mcu.Pin110=DSIHOST_D0P
Mcu.Pin111=DSIHOST_D0N
Mcu.Pin112=PA1
Mcu.Pin113=PA3
Mcu.Pin114=PA7
Mcu.Pin115=PF11
Mcu.Pin116=PF13
Mcu.Pin117=PE12
Mcu.Pin118=PH10
Mcu.Pin119=PH11
Mcu.Pin12=PD0
Mcu.Pin120=PB14
Mcu.Pin121=PA2
Mcu.Pin122=PA4
Mcu.Pin123=PB0
Mcu.Pin124=PB2
Mcu.Pin125=PF12
Mcu.Pin126=PE11
Mcu.Pin127=PB10
Mcu.Pin128=PB12
Mcu.Pin129=PB13
Mcu.Pin13=PI2
Mcu.Pin130=VP_DFSDM1_VS_IN0
Mcu.Pin131=VP_DFSDM1_VS_IN1
Mcu.Pin132=VP_DFSDM1_VS_IN4
Mcu.Pin133=VP_LTDC_DSIMode
Mcu.Pin134=VP_OCTOSPI1_VS_octo
Mcu.Pin135=VP_SYS_VS_Systick
Mcu.Pin14=PI1
Mcu.Pin15=PH15
Mcu.Pin16=PH12
Mcu.Pin17=PB8
Mcu.Pin18=PB6
Mcu.Pin19=PG15
Mcu.Pin2=PB4 (NJTRST)
Mcu.Pin20=PD4
Mcu.Pin21=PD1
Mcu.Pin22=PH13
Mcu.Pin23=PI3
Mcu.Pin24=PH9
Mcu.Pin25=PE4
Mcu.Pin26=PE3
Mcu.Pin27=PE2
Mcu.Pin28=PB9
Mcu.Pin29=PB7
Mcu.Pin3=PB3 (JTDO/TRACESWO)
Mcu.Pin30=PG10
Mcu.Pin31=PD5
Mcu.Pin32=PD2
Mcu.Pin33=PC10
Mcu.Pin34=PI4
Mcu.Pin35=PA10
Mcu.Pin36=PA12
Mcu.Pin37=PC13
Mcu.Pin38=PE6
Mcu.Pin39=PE5
Mcu.Pin4=PA15 (JTDI)
Mcu.Pin40=PG11
Mcu.Pin41=PD6
Mcu.Pin42=PD3
Mcu.Pin43=PC11
Mcu.Pin44=PI5
Mcu.Pin45=PA8
Mcu.Pin46=PA9
Mcu.Pin47=PA11
Mcu.Pin48=PC14-OSC32_IN (PC14)
Mcu.Pin49=PF2
Mcu.Pin5=PA14 (JTCK/SWCLK)
Mcu.Pin50=PF1
Mcu.Pin51=PF0
Mcu.Pin52=PG12
Mcu.Pin53=PD7
Mcu.Pin54=PC12
Mcu.Pin55=PC8
Mcu.Pin56=PG8
Mcu.Pin57=PC6
Mcu.Pin58=PC15-OSC32_OUT (PC15)
Mcu.Pin59=PF3
Mcu.Pin6=PA13 (JTMS/SWDIO)
Mcu.Pin60=PF4
Mcu.Pin61=PF5
Mcu.Pin62=PG13
Mcu.Pin63=PG4
Mcu.Pin64=PG3
Mcu.Pin65=PG5
Mcu.Pin66=PG7
Mcu.Pin67=PC7
Mcu.Pin68=PG6
Mcu.Pin69=PC9
Mcu.Pin7=PI0
Mcu.Pin70=PH0-OSC_IN (PH0)
Mcu.Pin71=PF10
Mcu.Pin72=PG1
Mcu.Pin73=PE10
Mcu.Pin74=PB11
Mcu.Pin75=PD13
Mcu.Pin76=PG2
Mcu.Pin77=PD15
Mcu.Pin78=PD14
Mcu.Pin79=PH1-OSC_OUT (PH1)
Mcu.Pin8=PH14
Mcu.Pin80=PC0
Mcu.Pin81=PC1
Mcu.Pin82=PC2
Mcu.Pin83=PG0
Mcu.Pin84=PE9
Mcu.Pin85=PE15
Mcu.Pin86=PD12
Mcu.Pin87=PD11
Mcu.Pin88=PD10
Mcu.Pin89=DSIHOST_D1P
Mcu.Pin9=PE1
Mcu.Pin90=DSIHOST_D1N
Mcu.Pin91=PC3
Mcu.Pin92=PA0
Mcu.Pin93=PC4
Mcu.Pin94=PF15
Mcu.Pin95=PE8
Mcu.Pin96=PE14
Mcu.Pin97=PH4
Mcu.Pin98=PD9
Mcu.Pin99=PD8
Mcu.PinsNb=136
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32L4R9AIIx
MxCube.Version=6.10.0
MxDb.Version=DB.6.0.100
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=GPIO_Label
PA0.GPIO_Label=MFX_IRQ_OUT [MFX_V3_IRQ_OUT] 
PA0.Locked=true
PA0.Signal=GPXTI0
PA1.GPIOParameters=GPIO_Label
PA1.GPIO_Label=OpAmp1_INM
PA1.Locked=true
PA1.Signal=OPAMP1_VINM
PA10.GPIOParameters=GPIO_Label
PA10.GPIO_Label=USBOTG_ID
PA10.Locked=true
PA10.Signal=USB_OTG_FS_ID
PA11.GPIOParameters=GPIO_Label
PA11.GPIO_Label=USBOTG_DM
PA11.Locked=true
PA11.Mode=Device_Only
PA11.Signal=USB_OTG_FS_DM
PA12.GPIOParameters=GPIO_Label
PA12.GPIO_Label=USBOTG_DP
PA12.Locked=true
PA12.Mode=Device_Only
PA12.Signal=USB_OTG_FS_DP
PA13\ (JTMS/SWDIO).GPIOParameters=GPIO_Label
PA13\ (JTMS/SWDIO).GPIO_Label=SWDIO
PA13\ (JTMS/SWDIO).Locked=true
PA13\ (JTMS/SWDIO).Mode=JTAG_5_pins
PA13\ (JTMS/SWDIO).Signal=SYS_JTMS-SWDIO
PA14\ (JTCK/SWCLK).GPIOParameters=GPIO_Label
PA14\ (JTCK/SWCLK).GPIO_Label=SWCLK
PA14\ (JTCK/SWCLK).Locked=true
PA14\ (JTCK/SWCLK).Mode=JTAG_5_pins
PA14\ (JTCK/SWCLK).Signal=SYS_JTCK-SWCLK
PA15\ (JTDI).GPIOParameters=GPIO_Label
PA15\ (JTDI).GPIO_Label=TDI
PA15\ (JTDI).Locked=true
PA15\ (JTDI).Mode=JTAG_5_pins
PA15\ (JTDI).Signal=SYS_JTDI
PA2.GPIOParameters=GPIO_Label
PA2.GPIO_Label=OCTOSPI1_NCS
PA2.Locked=true
PA2.Mode=OCTOSPI1_Port1_NCS
PA2.Signal=OCTOSPIM_P1_NCS
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=OCTOSPI1_CLK
PA3.Locked=true
PA3.Mode=O1_P1_CLK
PA3.Signal=OCTOSPIM_P1_CLK
PA4.GPIOParameters=GPIO_Label
PA4.GPIO_Label=ADC_DAC
PA4.Locked=true
PA4.Signal=SharedAnalog_PA4
PA5.GPIOParameters=GPIO_Label
PA5.GPIO_Label=LCD_BL_CTRL
PA5.Locked=true
PA5.Signal=GPIO_Output
PA6.GPIOParameters=GPIO_Label
PA6.GPIO_Label=OCTOSPI1_IO3
PA6.Locked=true
PA6.Mode=OCTOSPI1_IOL_Port1L
PA6.Signal=OCTOSPIM_P1_IO3
PA7.GPIOParameters=GPIO_Label
PA7.GPIO_Label=OCTOSPI1_IO2
PA7.Locked=true
PA7.Mode=OCTOSPI1_IOL_Port1L
PA7.Signal=OCTOSPIM_P1_IO2
PA8.GPIOParameters=GPIO_Label
PA8.GPIO_Label=SAI1_SCKA
PA8.Locked=true
PA8.Mode=SAI_A_MasterWithClock
PA8.Signal=SAI1_SCK_A
PA9.GPIOParameters=GPIO_Label
PA9.GPIO_Label=VBUS_FS
PA9.Locked=true
PA9.Mode=Activate_VBUS
PA9.Signal=USB_OTG_FS_VBUS
PB0.GPIOParameters=GPIO_Label
PB0.GPIO_Label=OCTOSPI1_IO1
PB0.Locked=true
PB0.Mode=OCTOSPI1_IOL_Port1L
PB0.Signal=OCTOSPIM_P1_IO1
PB1.GPIOParameters=GPIO_Label
PB1.GPIO_Label=OCTOSPI1_IO0
PB1.Locked=true
PB1.Mode=OCTOSPI1_IOL_Port1L
PB1.Signal=OCTOSPIM_P1_IO0
PB10.GPIOParameters=GPIO_Label
PB10.GPIO_Label=UART3_TX
PB10.Locked=true
PB10.Mode=Asynchronous
PB10.Signal=USART3_TX
PB11.GPIOParameters=GPIO_Label
PB11.GPIO_Label=UART3_RX
PB11.Locked=true
PB11.Mode=Asynchronous
PB11.Signal=USART3_RX
PB12.GPIOParameters=GPIO_Label
PB12.GPIO_Label=LPUART1_RTS
PB12.Locked=true
PB12.Mode=CTS_RTS
PB12.Signal=LPUART1_RTS
PB13.GPIOParameters=GPIO_Label
PB13.GPIO_Label=LPUART1_CTS
PB13.Locked=true
PB13.Mode=CTS_RTS
PB13.Signal=LPUART1_CTS
PB14.GPIOParameters=GPIO_Label
PB14.GPIO_Label=PMOD_RST
PB14.Locked=true
PB14.Signal=GPIO_Output
PB15.GPIOParameters=GPIO_Label
PB15.GPIO_Label=LED1
PB15.Locked=true
PB15.Signal=GPIO_Output
PB2.GPIOParameters=GPIO_Label
PB2.GPIO_Label=OCTOSPI1_DQS
PB2.Locked=true
PB2.Mode=OCTOSPI1_Port1_DQS
PB2.Signal=OCTOSPIM_P1_DQS
PB3\ (JTDO/TRACESWO).GPIOParameters=GPIO_Label
PB3\ (JTDO/TRACESWO).GPIO_Label=SWO
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Mode=JTAG_5_pins
PB3\ (JTDO/TRACESWO).Signal=SYS_JTDO-SWO
PB4\ (NJTRST).GPIOParameters=GPIO_Label
PB4\ (NJTRST).GPIO_Label=TRST
PB4\ (NJTRST).Locked=true
PB4\ (NJTRST).Mode=JTAG_5_pins
PB4\ (NJTRST).Signal=SYS_JTRST
PB5.GPIOParameters=GPIO_Label
PB5.GPIO_Label=SAI1_SDB
PB5.Locked=true
PB5.Mode=SAI_B_SyncSlave
PB5.Signal=SAI1_SD_B
PB6.GPIOParameters=GPIO_Label
PB6.GPIO_Label=SHIELD
PB6.Locked=true
PB6.Mode=G2_IO3-Sampling
PB6.Signal=TSC_G2_IO3
PB7.GPIOParameters=GPIO_Label
PB7.GPIO_Label=SHIELD_CS
PB7.Locked=true
PB7.Mode=G2_IO4-Channel
PB7.Signal=TSC_G2_IO4
PB8.GPIOParameters=GPIO_Label
PB8.GPIO_Label=SAI1_MCLKA
PB8.Locked=true
PB8.Mode=SAI_A_MasterWithClock
PB8.Signal=SAI1_MCLK_A
PB9.GPIOParameters=GPIO_Label
PB9.GPIO_Label=SAI1_FSA
PB9.Locked=true
PB9.Mode=SAI_A_MasterWithClock
PB9.Signal=SAI1_FS_A
PC0.GPIOParameters=GPIO_Label
PC0.GPIO_Label=DFSDM_DATA4
PC0.Locked=true
PC0.Signal=S_DATAIN4DFSDM1
PC1.GPIOParameters=GPIO_Label
PC1.GPIO_Label=SAI1_SDA
PC1.Locked=true
PC1.Mode=SAI_A_MasterWithClock
PC1.Signal=SAI1_SD_A
PC10.GPIOParameters=GPIO_Label
PC10.GPIO_Label=SDIO1_D2
PC10.Locked=true
PC10.Mode=SD_4_bits_Wide_bus
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=GPIO_Label
PC11.GPIO_Label=SDIO1_D3
PC11.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=GPIO_Label
PC12.GPIO_Label=SDIO1_CLK
PC12.Locked=true
PC12.Mode=SD_4_bits_Wide_bus
PC12.Signal=SDMMC1_CK
PC13.GPIOParameters=GPIO_Label
PC13.GPIO_Label=WAKEUP
PC13.Locked=true
PC13.Signal=RTC_TAMP1
PC14-OSC32_IN\ (PC14).Locked=true
PC14-OSC32_IN\ (PC14).Mode=LSE-External-Oscillator
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
PC15-OSC32_OUT\ (PC15).Locked=true
PC15-OSC32_OUT\ (PC15).Mode=LSE-External-Oscillator
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label
PC2.GPIO_Label=LCD_INT
PC2.Locked=true
PC2.Signal=GPXTI2
PC3.Mode=OCTOSPI1_IOH_Port1H
PC3.Signal=OCTOSPIM_P1_IO6
PC4.Mode=OCTOSPI1_IOH_Port1H
PC4.Signal=OCTOSPIM_P1_IO7
PC6.GPIOParameters=GPIO_Label
PC6.GPIO_Label=TKEY
PC6.Locked=true
PC6.Mode=G4_IO1-Sampling
PC6.Signal=TSC_G4_IO1
PC7.GPIOParameters=GPIO_Label
PC7.GPIO_Label=TKEY_CS
PC7.Locked=true
PC7.Mode=G4_IO2-Shield
PC7.Signal=TSC_G4_IO2
PC8.GPIOParameters=GPIO_Label
PC8.GPIO_Label=SDIO1_D0
PC8.Locked=true
PC8.Mode=SD_4_bits_Wide_bus
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=GPIO_Label
PC9.GPIO_Label=SDIO1_D1
PC9.Locked=true
PC9.Mode=SD_4_bits_Wide_bus
PC9.Signal=SDMMC1_D1
PD0.GPIOParameters=GPIO_Label
PD0.GPIO_Label=D2
PD0.Locked=true
PD0.Signal=FMC_D2_DA2
PD1.GPIOParameters=GPIO_Label
PD1.GPIO_Label=D3
PD1.Locked=true
PD1.Signal=FMC_D3_DA3
PD10.GPIOParameters=GPIO_Label
PD10.GPIO_Label=D15
PD10.Locked=true
PD10.Signal=FMC_D15_DA15
PD11.GPIOParameters=GPIO_Label
PD11.GPIO_Label=A16
PD11.Locked=true
PD11.Signal=FMC_A16_CLE
PD12.GPIOParameters=GPIO_Label
PD12.GPIO_Label=A17
PD12.Locked=true
PD12.Signal=FMC_A17_ALE
PD13.GPIOParameters=GPIO_Label
PD13.GPIO_Label=A18
PD13.Locked=true
PD13.Signal=FMC_A18
PD14.GPIOParameters=GPIO_Label
PD14.GPIO_Label=D0
PD14.Locked=true
PD14.Signal=FMC_D0_DA0
PD15.GPIOParameters=GPIO_Label
PD15.GPIO_Label=D1
PD15.Locked=true
PD15.Signal=FMC_D1_DA1
PD2.GPIOParameters=GPIO_Label
PD2.GPIO_Label=SDIO1_CMD
PD2.Locked=true
PD2.Mode=SD_4_bits_Wide_bus
PD2.Signal=SDMMC1_CMD
PD3.GPIOParameters=GPIO_Label
PD3.GPIO_Label=LCD_CLK
PD3.Locked=true
PD3.Signal=LTDC_CLK
PD4.GPIOParameters=GPIO_Label
PD4.GPIO_Label=FMC_NOE
PD4.Locked=true
PD4.Signal=FMC_NOE
PD5.GPIOParameters=GPIO_Label
PD5.GPIO_Label=FMC_NWE
PD5.Locked=true
PD5.Signal=FMC_NWE
PD6.GPIOParameters=GPIO_Label
PD6.GPIO_Label=FMC_NWAIT
PD6.Locked=true
PD6.Signal=FMC_NWAIT
PD7.GPIOParameters=GPIO_Label
PD7.GPIO_Label=FMC_NE1
PD7.Locked=true
PD7.Mode=NorPsramChipSelect1_1
PD7.Signal=FMC_NE1
PD8.GPIOParameters=GPIO_Label
PD8.GPIO_Label=D13
PD8.Locked=true
PD8.Signal=FMC_D13_DA13
PD9.GPIOParameters=GPIO_Label
PD9.GPIO_Label=D14
PD9.Locked=true
PD9.Signal=FMC_D14_DA14
PE0.GPIOParameters=GPIO_Label
PE0.GPIO_Label=FMC_NBL0
PE0.Locked=true
PE0.Signal=FMC_NBL0
PE1.GPIOParameters=GPIO_Label
PE1.GPIO_Label=FMC_NBL1
PE1.Locked=true
PE1.Signal=FMC_NBL1
PE10.GPIOParameters=GPIO_Label
PE10.GPIO_Label=D7
PE10.Locked=true
PE10.Signal=FMC_D7_DA7
PE11.GPIOParameters=GPIO_Label
PE11.GPIO_Label=D8
PE11.Locked=true
PE11.Signal=FMC_D8_DA8
PE12.GPIOParameters=GPIO_Label
PE12.GPIO_Label=D9
PE12.Locked=true
PE12.Signal=FMC_D9_DA9
PE13.GPIOParameters=GPIO_Label
PE13.GPIO_Label=D10
PE13.Locked=true
PE13.Signal=FMC_D10_DA10
PE14.GPIOParameters=GPIO_Label
PE14.GPIO_Label=D11
PE14.Locked=true
PE14.Signal=FMC_D11_DA11
PE15.GPIOParameters=GPIO_Label
PE15.GPIO_Label=D12
PE15.Locked=true
PE15.Signal=FMC_D12_DA12
PE2.GPIOParameters=GPIO_Label
PE2.GPIO_Label=A23
PE2.Locked=true
PE2.Signal=FMC_A23
PE3.GPIOParameters=GPIO_Label
PE3.GPIO_Label=A19
PE3.Locked=true
PE3.Signal=FMC_A19
PE4.GPIOParameters=GPIO_Label
PE4.GPIO_Label=A20
PE4.Locked=true
PE4.Signal=FMC_A20
PE5.GPIOParameters=GPIO_Label
PE5.GPIO_Label=A21
PE5.Locked=true
PE5.Signal=FMC_A21
PE6.GPIOParameters=GPIO_Label
PE6.GPIO_Label=A22
PE6.Locked=true
PE6.Signal=FMC_A22
PE7.GPIOParameters=GPIO_Label
PE7.GPIO_Label=D4
PE7.Locked=true
PE7.Signal=FMC_D4_DA4
PE8.GPIOParameters=GPIO_Label
PE8.GPIO_Label=D5
PE8.Locked=true
PE8.Signal=FMC_D5_DA5
PE9.GPIOParameters=GPIO_Label
PE9.GPIO_Label=D6
PE9.Locked=true
PE9.Signal=FMC_D6_DA6
PF0.GPIOParameters=GPIO_Label
PF0.GPIO_Label=A0
PF0.Locked=true
PF0.Signal=FMC_A0
PF1.GPIOParameters=GPIO_Label
PF1.GPIO_Label=A1
PF1.Locked=true
PF1.Signal=FMC_A1
PF10.GPIOParameters=GPIO_Label
PF10.GPIO_Label=DFSDM_CLK
PF10.Locked=true
PF10.Signal=S_CKOUTDFSDM1
PF11.GPIOParameters=GPIO_Label
PF11.GPIO_Label=DSI_TE
PF11.Locked=true
PF11.Signal=DSIHOST_TE
PF12.GPIOParameters=GPIO_Label
PF12.GPIO_Label=A6
PF12.Locked=true
PF12.Signal=FMC_A6
PF13.GPIOParameters=GPIO_Label
PF13.GPIO_Label=A7
PF13.Locked=true
PF13.Signal=FMC_A7
PF14.GPIOParameters=GPIO_Label
PF14.GPIO_Label=A8
PF14.Locked=true
PF14.Signal=FMC_A8
PF15.GPIOParameters=GPIO_Label
PF15.GPIO_Label=A9
PF15.Locked=true
PF15.Signal=FMC_A9
PF2.GPIOParameters=GPIO_Label
PF2.GPIO_Label=A2
PF2.Locked=true
PF2.Signal=FMC_A2
PF3.GPIOParameters=GPIO_Label
PF3.GPIO_Label=A3
PF3.Locked=true
PF3.Signal=FMC_A3
PF4.GPIOParameters=GPIO_Label
PF4.GPIO_Label=A4
PF4.Locked=true
PF4.Signal=FMC_A4
PF5.GPIOParameters=GPIO_Label
PF5.GPIO_Label=A5
PF5.Locked=true
PF5.Signal=FMC_A5
PG0.GPIOParameters=GPIO_Label
PG0.GPIO_Label=A10
PG0.Locked=true
PG0.Signal=FMC_A10
PG1.GPIOParameters=GPIO_Label
PG1.GPIO_Label=A11
PG1.Locked=true
PG1.Signal=FMC_A11
PG10.GPIOParameters=GPIO_Label
PG10.GPIO_Label=FMC_NE3
PG10.Locked=true
PG10.Mode=NorPsramChipSelect3_2
PG10.Signal=FMC_NE3
PG11.Mode=OCTOSPI1_IOH_Port1H
PG11.Signal=OCTOSPIM_P1_IO5
PG12.GPIOParameters=GPIO_Label
PG12.GPIO_Label=SPI_CS
PG12.Locked=true
PG12.Signal=SPI3_NSS
PG13.GPIOParameters=GPIO_Label
PG13.GPIO_Label=PMOD_INT
PG13.Locked=true
PG13.Signal=GPXTI13
PG15.GPIOParameters=GPIO_Label
PG15.GPIO_Label=OCTOSPI2_DQS
PG15.Locked=true
PG15.Signal=OCTOSPIM_P2_DQS
PG2.GPIOParameters=GPIO_Label
PG2.GPIO_Label=A12
PG2.Locked=true
PG2.Signal=FMC_A12
PG3.GPIOParameters=GPIO_Label
PG3.GPIO_Label=A13
PG3.Locked=true
PG3.Signal=FMC_A13
PG4.GPIOParameters=GPIO_Label
PG4.GPIO_Label=A14
PG4.Locked=true
PG4.Signal=FMC_A14
PG5.GPIOParameters=GPIO_Label
PG5.GPIO_Label=A15
PG5.Locked=true
PG5.Signal=FMC_A15
PG6.GPIOParameters=GPIO_Label
PG6.GPIO_Label=SWIRE
PG6.Locked=true
PG6.Signal=GPIO_Output
PG7.GPIOParameters=GPIO_Label
PG7.GPIO_Label=LPUART1_TX
PG7.Locked=true
PG7.Mode=Asynchronous
PG7.Signal=LPUART1_TX
PG8.GPIOParameters=GPIO_Label
PG8.GPIO_Label=LPUART\!_RX
PG8.Locked=true
PG8.Mode=Asynchronous
PG8.Signal=LPUART1_RX
PG9.GPIOParameters=GPIO_Label
PG9.GPIO_Label=MFX_WAKEUP
PG9.Locked=true
PG9.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).Locked=true
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).Locked=true
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PH10.GPIOParameters=GPIO_Label
PH10.GPIO_Label=OCTOSPI2_IO5
PH10.Locked=true
PH10.Signal=OCTOSPIM_P2_IO5
PH11.GPIOParameters=GPIO_Label
PH11.GPIO_Label=OCTOSPI2_IO6
PH11.Locked=true
PH11.Signal=OCTOSPIM_P2_IO6
PH12.GPIOParameters=GPIO_Label
PH12.GPIO_Label=OCTOSPI2_IO7
PH12.Locked=true
PH12.Signal=OCTOSPIM_P2_IO7
PH13.GPIOParameters=GPIO_Label
PH13.GPIO_Label=LED2
PH13.Locked=true
PH13.Signal=GPIO_Output
PH14.GPIOParameters=GPIO_Label
PH14.GPIO_Label=LED3
PH14.Locked=true
PH14.Signal=GPIO_Output
PH15.GPIOParameters=GPIO_Label
PH15.GPIO_Label=LED4
PH15.Locked=true
PH15.Signal=GPIO_Output
PH2.Mode=OCTOSPI1_IOH_Port1H
PH2.Signal=OCTOSPIM_P1_IO4
PH4.GPIOParameters=GPIO_Label,GPIO_Pu
PH4.GPIO_Label=I2C2_SCL
PH4.GPIO_Pu=GPIO_PULLUP
PH4.Locked=true
PH4.Mode=I2C
PH4.Signal=I2C2_SCL
PH5.GPIOParameters=GPIO_Label,GPIO_Pu
PH5.GPIO_Label=I2C2_SDA
PH5.GPIO_Pu=GPIO_PULLUP
PH5.Locked=true
PH5.Mode=I2C
PH5.Signal=I2C2_SDA
PH9.GPIOParameters=GPIO_Label
PH9.GPIO_Label=OCTOSPI2_IO4
PH9.Locked=true
PH9.Signal=OCTOSPIM_P2_IO4
PI0.GPIOParameters=GPIO_Label
PI0.GPIO_Label=SPI2_NSS
PI0.Locked=true
PI0.Mode=NSS_Signal_Hard_Input
PI0.Signal=SPI2_NSS
PI1.GPIOParameters=GPIO_Label
PI1.GPIO_Label=SPI2_SCK
PI1.Locked=true
PI1.Mode=Full_Duplex_Master
PI1.Signal=SPI2_SCK
PI2.GPIOParameters=GPIO_Label
PI2.GPIO_Label=SPI2_MISO
PI2.Locked=true
PI2.Mode=Full_Duplex_Master
PI2.Signal=SPI2_MISO
PI3.GPIOParameters=GPIO_Label
PI3.GPIO_Label=SPI2_MOSI
PI3.Locked=true
PI3.Mode=Full_Duplex_Master
PI3.Signal=SPI2_MOSI
PI4.GPIOParameters=GPIO_Label
PI4.GPIO_Label=Audio_INT
PI4.Locked=true
PI4.Signal=GPXTI4
PI5.GPIOParameters=GPIO_Label
PI5.GPIO_Label=OCTOSPI2_NCS
